app/controllers/api/v1/resturants_controller.rb

SELECT "resturants".* FROM "resturants"
---
  def index
    @resturants = Resturant.all

INSERT INTO "resturants" ("item", "price", "quantity", "total", "selected", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item", "Chips"], ["price", "12"], ["quantity", 1], ["total", "12"], ["selected", "t"], ["created_at", "2017-10-25 10:44:19.452111"], ["updated_at", "2017-10-25 10:44:19.452111"]]
---
  def create
    @resturant = Resturant.new(params_resturant)
    @resturant.save

SELECT  "resturants".* FROM "resturants" WHERE "resturants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: @resturant = Resturant.find(params[:id])